import React from 'react'
import { useNavigate } from 'react-router-dom';

function Agreements() {
  const navigate = useNavigate();

  return (
    <div className='lg:container lg:mx-auto md:py-2  px-10 md:px-20 lg:px-40'>
      <h1 className='font-semibold mt-4'>Политика конфиденциальности Top-Class</h1>

      <h1 className='font-semibold mt-4'>1. Вводная часть</h1>

      <p className=' mt-4'>1.1. Настоящая политика конфиденциальности была разработана и утверждена
        компанией ИП ООО «Weayaa LLC» с целью обеспечения безопасности и
        сохранности конфиденциальных данных, получаемых от Покупателей и Продавцов
        маркетплейса Top-Class, а также иных целей, подробнее описанных в Разделе «Цели
        обработки» ниже (далее – <span className="font-bold">«Политика конфиденциальности»</span>).</p>

      <p className=' mt-4'>1.2. Данная Политика конфиденциальности является неотъемлемой частью
        Пользовательского соглашения и Договора с продавцами. Принимая (совершая
        акцепт оферты) или подписывая один из таких документов, соответствующий
        Покупатель и/или Продавец выражает своё безоговорочное согласие на обработку
        всей информации, определенной ниже как Конфиденциальная информация в
        соответствии с условиями Политики Конфиденциальности.</p>

      <h1 className='font-semibold mt-4'>2. Основные понятия</h1>

      <p className=' mt-4'>2.1.<span className="font-bold">Автоматизированная обработка Конфиденциальной информации </span> –
        обработка конфиденциальной информации с помощью средств вычислительной
        техники.</p>

      <p className=' mt-4'>2.2.<span className="font-bold">Блокирование Конфиденциальной информации</span> – временное прекращение
        обработки Конфиденциальной информации (за исключением случаев, если
        обработка необходима для уточнения Конфиденциальной информации).</p>

      <p className=' mt-4'>2.3.<span className="font-bold">Weayaa LLC</span> – компании входящие в цифровую IT-экосистему, включая, но не
        ограничиваясь ИП ООО “Top-Class”, и их аффилированными лицами.</p>

      <p className=' mt-4'>2.4. <span className="font-bold">Информационная система Конфиденциальной информации </span> — совокупность
        содержащихся в базах данных Конфиденциальной информации данных, и
        обеспечивающих их обработку информационных технологий, и технических средств.</p>

      <p className=' mt-4'>2.5. <span className="font-bold">Информация о юридическом лице </span>- любая информация, зафиксированная на
        электронном, бумажном и (или) ином материальном носителе, включая, но не
        ограничиваясь, наименованиями юридических лиц, контактными данные (почтовые
        адреса, электронные адреса, телефонные номера) и иной информацией получаемая
        Top-Class от Продавцов.</p>

      <p className=' mt-4'>2.6.<span className="font-bold">Коммерческая тайна </span> - информация, имеющая коммерческую ценность в
        научно-технической, технологической, производственной, финансово-
        экономической и других сферах в силу неизвестности ее третьим лицам.</p>

      <p className=' mt-4'>2.7. <span className="font-bold">Конфиденциальная информация </span> – информация, в том числе персональные
        данные, которую Top-Class получает от Продавцов и Покупателей во время
        регистрации и использования ими маркетплейса Top-Class</p>

      <p className=' mt-4'>2.8. <span className="font-bold">Продавец</span> - индивидуальный предприниматель или юридическое лицо,
        осуществляющий деятельность по продаже товаров через Маркетплейс Покупателю
        с использованием дистанционного способа и прошедшие регистрацию на
        Маркетплейсе.</p>

      <p className=' mt-4'>2.9. <span className="font-bold">Обезличивание персональных данных</span> — действия, в результате которых
        невозможно определить без использования дополнительной информации
        принадлежность персональных данных конкретному Покупателю или иному
        субъекту персональных данных.</p>

      <p className=' mt-4' >2.10.<span className="font-bold"> Обработка Конфиденциальной информации </span> – любое действие (операция)
        или совокупность действий (операций), совершаемых с использованием средств
        автоматизации или без использования таких средств с Конфиденциальной
        информации, включая сбор, запись, систематизацию, накопление, хранение,
        уточнение (обновление, изменение), извлечение, использование, передачу
        (распространение, предоставление, доступ), обезличивание, блокирование,
        удаление, уничтожение Конфиденциальной информации.</p>

      <p className=' mt-4'>2.11. <span className="font-bold">  Персональные данные </span> – любая информация, зафиксированная на
        электронном, бумажном и (или) ином материальном носителе, которая относится к
        определенному физическому лицу или дающая возможность его идентификации.</p>

      <p className=' mt-4'>2.12.<span className="font-bold">  Предоставление Конфиденциальной информации  </span> – действия, направленные
        на раскрытие персональных данных определенному лицу или определенному кругу
        лиц.</p>

      <p className=' mt-4'>2.13. <span className="font-bold"> Распространение Конфиденциальной информации</span> – любые действия,
        направленные на раскрытие Конфиденциальной информации неопределенному
        кругу лиц (передача Конфиденциальной информации) или на ознакомление с
        Конфиденциальной информацией неограниченного круга лиц, в том числе
        обнародование Конфиденциальной информации в средствах массовой информации,
        размещение в информационно-телекоммуникационных сетях или предоставление
        доступа к Конфиденциальной информации каким-либо иным способом.</p>

      <p className=' mt-4'>2.14.<span className="font-bold">  Маркетплейс Top-Class</span> - программы для ЭВМ и базы данных (включая
        мобильное приложение Top-Class), позволяющие Покупателям совершить Заказ
        товаров у Продавцов.</p>

      <p className=' mt-4'>2.15. <span className="font-bold">  Трансграничная передача персональных данных </span>– передача персональных
        данных на территорию иностранного государства органу власти иностранного
        государства, иностранному физическому или иностранному юридическому лицу.</p>

      <p className=' mt-4'>2.16. <span className="font-bold"> Уничтожение персональных данных</span> – любые действия, в результате которых
        персональные данные уничтожаются безвозвратно с невозможностью дальнейшего
        восстановления содержания персональных данных в информационной системе
        персональных данных и (или) результате которых уничтожаются материальные
        носители персональных данных.</p>

      <h1 className='font-semibold mt-4'>3. Предмет регулирования</h1>

      <p className=' mt-4'>3.1. Данная Политика конфиденциальности действует в отношении всей
        Конфиденциальной информации», которую Top-Class и/или его аффилированные
        лица, в том числе Группа компаний WeaYaa LLC, могут получить от Покупателей и
        Продавцов в процессе их взаимодействия с Маркетплейсом Top-Class, а также в
        ходе исполнения Top-Class любых соглашений и договоров, заключенных с
        Покупателем и Продавцом для целей и/или в результате использования
        Покупателями и продавцами .</p>

      <h1 className='font-semibold mt-4'>4. Кто обрабатывает данные</h1>

      <p className=' mt-4'>4.1. Конфиденциальная информация, получаемая Компанией в отношении каждого
        Покупателя и продавца собирается, обрабатывается, хранится и используется
        Компанией – иностранным предприятием обществом с ограниченной
        ответственностью «Top-Class», юридическое лицо, созданное по законодательству
        Республики Узбекистан и зарегистрированное по адресу: Республика Узбекистан, г.
        Ташкент, Яккасарайский район, ул. Бешчинар, д.2., или его аффилированными
        лицами.</p>

      <h1 className='font-semibold mt-4'>5. Какая информация обрабатывается Top-Class</h1>

      <p className=' mt-4'>5.1. Конфиденциальная информация, которую Top-Class обрабатывает в отношении
        Покупателей и Продавцов, может различаться в зависимости от того каким образом
        Покупатель или Продавец взаимодействует с Маркетплейсом Top-Class и использует
        ли Покупатель или Продавец личный кабинет для доступа к Маркетплейсу Top-Class</p>

      <p className=' mt-4'>5.2. Top-Class собирает и обрабатывает, где применимо, следующие категории
        информации:</p>

      <ul className="list-disc list-inside mt-4">
        <li>Персональные данные;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Информацию о юридических лицах и их представителях;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Коммерческую тайну;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Техническую информация;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Ноу-хау;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Иную информация, не подлежащую разглашению третьим лицам.</li>
      </ul>

      <p className=' mt-4'>5.3. Top-Class получает нижеследующие данные:</p>

      <p className=' mt-4'>5.3.1. Конфиденциальная информация, получаемая от Покупателей:</p>

      <p className=' mt-4'>5.3.1.1. Данные, необходимые для регистрации в Top-Class</p>

      <ul className="list-disc list-inside mt-4">
        <li> Ф.И.О</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Номер мобильного телефона;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>аккаунта Google;</li>
      </ul>

      <p className=' mt-4'>5.3.1.1. Данные, необходимые для регистрации в Top-Class</p>

      <ul className="list-disc list-inside mt-4">
        <li>Имя;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Фамилия;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li> Пол;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Дата рождения;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Адрес доставки товаров;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Номер мобильного телефона.</li>
      </ul>

      <p className=' mt-4'>5.3.1.3. Информация, которая передается автоматически при взаимодействии с
        приложением Top-Class</p>

      <ul className="list-disc list-inside mt-4">
        <li>IP адрес и файлы cookies;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Тип выполненного на сайте действия (клик, наведение курсора и т.п.);</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Дата и время выполнения действия;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>URL страницы;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Количество посещений страниц;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Информация о перемещении по страницам сайта;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Длительность пользовательской сессии;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Точки входа (сторонние сайты, с которых пользователь по ссылке переходит
          на Сайт);</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Точки выхода (ссылки на Сайте, по которым пользователь переходит на
          сторонние сайты);</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Страна;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Регион;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Провайдер;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Браузер пользователя;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Перечень поддерживаемых языков на устройстве;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Тип ОС;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Параметры экрана.</li>
      </ul>

      <p className=' mt-4'>Конфиденциальные данные, получаемые от Продавцов:</p>

      <p className=' mt-4'>5.3.2.1. Информация, получаемая от Продавцов:</p>

      <ul className="list-disc list-inside mt-4">
        <li>Наименование юридического лица;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>ИНН;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>ОКЭД;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>ПИНФЛ;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Банковские реквизиты;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Юридический и почтовые адреса;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Ф.И.О и контактные данные представителе Продавцов;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li> Информация от Магазинов (Клиентов) в отношении приобретения
          Пользователем их товаров и (или) услуг.</li>
      </ul>

      <p className=' mt-4'>5.3.2.2. Информация, которая передается автоматически при взаимодействии с
        приложением Top-Class</p>

      <ul className="list-disc list-inside mt-4">
        <li>Статусы заказа;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>Состав заказа.</li>
      </ul>

      <p className=' mt-4'>5.3.3. Иная информация, запрашиваемая Top-Class, в целях исполнения обязательств
        по Пользовательскому соглашению, Договору с Продавцом.</p>

      <p className=' mt-4'>5.4. Указанные положения Политики включают в себя и трансграничную передачу
        Конфиденциальной информации. Трансграничная передача Конфиденциальной
        информации осуществляется на территорию иностранных государств,
        обеспечивающих адекватную защиту прав субъектов персональных данных.</p>

      <p className=' mt-4'>5.6. Top-Class не проверяет предоставленную Конфиденциальную информацию за
        исключением случаев, предусмотренных Пользовательским соглашением, Договора
        с Продавцом, и не может судить о ее достоверности, а также о том, обладает ли
        Покупатель достаточной правоспособностью для предоставления
        Конфиденциальной информации, были ли получены соответствующие согласия о
        передаче персональных данных представителей Продавцов. Top-Class исходит из
        того, что Покупатель предоставляет достоверную и достаточную Конфиденциальную
        информацию, а также своевременно обновляет ее, а Продавцами были получены
        все необходимые согласия на передачу персональных данных своих представителей.</p>

      <p className=' mt-4'>5.7. Top-Class стремится обеспечивать защиту Конфиденциальной информации во
        время её обработки. Top-Class рекомендуем посещать этот веб-сайт регулярно,
        поскольку настоящая Политика конфиденциальности может обновляться в
        соответствии с поправками в действующем законодательстве или изменениями в
        наших внутренних процессах.</p>

      <p className=' mt-4'>5.9. Покупатель и Продавец предоставляет Конфиденциальную информацию по
        своей собственной воле. При этом, непредставление какой-либо Конфиденциальной
        информации, либо отзыв согласия на обработку Конфиденциальной информации
        может привести к невозможности использования Маркетплейса Top-Class</p>

      <h1 className='font-semibold mt-4'>6. Цели обработки</h1>

      <p className=' mt-4'>6.1. Обработка Конфиденциальной информации необходима для:</p>

      <ul className="list-disc list-inside mt-4">
        <li> выполнения условий договоров между Покупателями, продавцами и Top-
          Class, в том числе Пользовательского соглашения, Договоров с Продавцами;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>обеспечения функционирования и совершенствования Маркетплейса Top-
          Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>осуществления прав и законных интересов Top-Class и группы компаний Top-
          Class, при условии, что такая обработка не оказывает существенного влияния
          на права и законные интересы Покупателей и Продавцов Маркетплейса Top-
          Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>соблюдения норм, установленных законодательством Республики Узбекистан.</li>
      </ul>

      <p className=' mt-4'>6.2. Top-Class обрабатывает Конфиденциальную информацию для следующих целей:</p>

      <ul className="list-disc list-inside mt-4">
        <li>предоставление доступа к Маркетплейсу Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>предоставление доступа к личному кабинету Покупателю и продавцу;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>обработка и оформление заказов по покупке Товаров на Маркетплейсе Top-
          Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>организация приема платежей, осуществления оплаты товаров с
          использованием Маркетплейса Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>осуществление связи с Покупателями и Продавцами, направление
          уведомлений, запросов и другой информации, касающейся работы Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>защита Покупателей и Продавцов от мошеннических действий;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>распространение рекламно-информационных материалов и проведение
          совместных маркетинговых акций Top-Class и группы WeaYaa LLC, с учетом
          предпочтений Покупателей и Продавцов;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>постоянное совершенствование и улучшение Маркетплейса Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>исследование поведения пользователей Маркетплейса Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>создание новых продуктов, утилит и предложений Top-Class и группы
          компаний WeaYaa LLC;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>защита прав Покупателя и Продавца;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>сбор, обработка и представление статистических данных, больших данных и
          других исследований.</li>
      </ul>

      <p className=' mt-4'>6.3. В случае возникновения дополнительных целей либо в соответствии с
        требованием применимого законодательства Top-Class может запросить отдельное
        согласие на обработку Конфиденциальной информации.</p>

      <p className=' mt-4'>6.4. Настоящая Политика распространяется на Конфиденциальную информацию,
        полученную как до, так и после ввода в действие настоящей Политики.</p>

      <h1 className='font-semibold mt-4'>7. Порядок сбора, хранения, передачи и других видов обработки
        Конфиденциальной информации</h1>

      <p className=' mt-4'>7.1. Безопасность Конфиденциальной информации, которая обрабатывается Top-
        Class, обеспечивается путем реализации правовых, организационных и технических
        мер, необходимых для выполнения в полном объеме требований действующего
        законодательства в области защиты персональных данных.</p>

      <p className=' mt-4'>7.2. Top-Class обеспечивает сохранность Конфиденциальной информации и
        принимает все возможные меры, исключающие доступ к Конфиденциальной
        информации неуполномоченных лиц. Конфиденциальная информация будет
        использоваться сотрудниками Top-Class по мере необходимости для целей,
        указанных в разделе 4 данной Политики.</p>

      <p className=' mt-4'>7.3. Top-Class также может передавать Конфиденциальную информацию своим
        аффилированным лицам, включая компании, входящие в группу WeaYaa LLC, только
        для целей, указанных в разделе 4 настоящей Политики.</p>

      <p className=' mt-4'>7.4. Конфиденциальная информация Покупателя и Продавца никогда, ни при каких
        условиях не будут передана третьим лицам, за исключением случаев, связанных с
        исполнением действующего законодательства и/или для целей осуществления
        обработки Конфиденциальной информации в интересах Top-Class.</p>

      <p className=' mt-4'>7.5. Для оказания определенных услуг по Пользовательскому соглашению, Договору
        с Продавцами, Top-Class может привлекать третьих лиц. Если таким лицам
        необходим доступ к Конфиденциальной информации, Top-Class проследит, чтобы
        такой доступ был ограничен в объеме, необходимом для оказания соответствующих
        услуг. Кроме того, такие внешние поставщики услуг должны самостоятельно
        исполнять все действующие правила защиты данных. К категориям таких
        получателей относятся поставщики следующих видов услуг: веб-аналитика,
        обработка данных, реклама, рассылки по электронной почте, обработка платежей,
        выполнение заказов и т.д.</p>

      <p className=' mt-4'>7.6. Сроком хранения Конфиденциальной информации Top-Class определяется дата
        достижения цели, для которой она была собрана и обработана или для соблюдения
        требований законодательства Республики Узбекистан.</p>

      <p className=' mt-4'>7.7. Вся Конфиденциальная информация, полученная от Покупателей и Продавцов,
        будет хранится на территории Республики Узбекистан.</p>

      <p className=' mt-4'>7.8. Обработка Конфиденциальной информации осуществляется как с
        использованием автоматизированных средств, так и без использования средств
        автоматизации.</p>

      <h1 className='font-semibold mt-4'>8. Трансграничная передача персональных данных</h1>

      <p className=' mt-4'>8.1. Top-Class вправе осуществлять трансграничную передачу персональных данных
        в соответствии с условиями настоящей Политики и с соблюдением требований
        законодательства Республики Узбекистан.</p>

      <h1 className='font-semibold mt-4'>9. Права владельца Конфиденциальной информации</h1>

      <p className=' mt-4'>9.1. Права Пользователей:</p>

      <ul className="list-disc list-inside mt-4">
        <li>самостоятельно вносить изменения, дополнения в информацию о себе
          в Личном кабинете на Маркетплейсе Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>удалять Конфиденциальную информацию о себе, предоставленную в Личном
          кабинете на Маркетплейсе Top-Class. Удаление Личного кабинета, и/или
          Конфиденциальной информации может повлечь невозможность
          использования Маркетплейса Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>по запросу получать от Top-Class информацию, касающуюся обработки своих
          персональных данных;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>знать о наличии у Top-Class своей Конфиденциальной информации и её
          объем;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>получать информацию об условиях предоставления доступа к своей
          Конфиденциальной информации от Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>отозвать согласие на обработку своей Конфиденциальной информации,
          кроме случаев, предусмотренных применимым законодательством;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>требовать от Top-Class временного приостановления обработки своих
          персональных данных в случае, если персональные данные являются
          неполными, устаревшими, неточными, незаконно полученными или не
          являются необходимыми для целей обработки;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>обращаться по вопросам защиты прав и законных интересов в отношении
          своих персональных данных в уполномоченный государственный орган или
          суд.</li>
      </ul>

      <p className=' mt-4'>9.2. Права Продавцов:</p>

      <ul className="list-disc list-inside mt-4">
        <li>самостоятельно вносить изменения, дополнения в Конфиденциальную
          информацию о себе и своих представителях в Личном кабинете
          на Маркетплейсе Top-Class; </li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>удалять Конфиденциальную информацию, предоставленную в Личном
          кабинете на Маркетплейсе Top-Class. Удаление Личного кабинета, и/или
          Конфиденциальной информации может повлечь невозможность
          использования Top-Class; </li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>знать о наличии у Top-Class своей Конфиденциальной информации и её
          объем; </li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>получать информацию об условиях предоставления доступа к своей
          Конфиденциальной информации от Top-Class;</li>
      </ul>

      <ul className="list-disc list-inside mt-4">
        <li>требовать от Top-Class временного приостановления обработки
          Конфиденциальной информации в случае, если персональные данные
          являются неполными, устаревшими, неточными, незаконно полученными или
          не являются необходимыми для целей обработки. </li>
      </ul>

      <h1 className='font-semibold mt-4'>10. Заключительные положения</h1>

      <p className=' mt-4'>10.1. Настоящая Политика, отношения между Покупателем и Продавцом,
        возникающие в связи с применением настоящей Политики, а также вопросы, не
        урегулированные настоящей Политикой, регулируются действующим
        законодательством Республики Узбекистан.</p>

      <p className=' mt-4'>10.2. Пользователь может получить любые разъяснения по интересующим
        вопросам, касающимся обработки его Конфиденциальной информации,
        обратившись в колл центр Top-Class.</p>

      <p className=' mt-4'>10.3. В случае выявления факта незаконного использования Конфиденциальной
        информации, субъект Конфиденциальных данных, чьи данные незаконно
        используются, направляет в адрес Top-Class письменное заявление об удалении
        такой Конфиденциальной информации. В заявлении необходимо указать реквизиты
        документа, удостоверяющего личность субъекта Конфиденциальной информации,
        состав незаконно используемой Конфиденциальной информации, описание, где и
        при каких обстоятельствах Конфиденциальная информация незаконно используется.</p>

      <p className=' mt-4'>10.4. Каждый пользователь/продавец/покупатель при регистрации соглашается с
        Политикой пользовательского контента (http://www.top-class.com) при
        использовании сервиса Top-class, сайта www.Top-Class.com.</p>

      <p className=' mt-4'>10.5. Top-Class вправе вносить изменения в настоящую Политику без согласия
        покупателей и продавцов.</p>

      <p className=' mt-4'>10.6. В данном документе будут отражены любые изменения, вносимые Top-Class в
        Политику. Политика действует бессрочно до замены ее новой версией.</p>

      <p className=' mt-4'>10.7. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу   
         <a href="/conditions" target="_blank" rel="noopener noreferrer" className="text-blue-500 underline ml-1"> Условия использования. </a> 
      </p>



    </div>


  )
}

export default Agreements