import React from 'react'
import { useNavigate } from 'react-router-dom';

function Сonditions() {
    const navigate = useNavigate();
  return (
    <div className='lg:container lg:mx-auto md:py-2  px-10 md:px-20 lg:px-40'>

      <p className='mt-8'>Статья 1 (Цель)</p>

      <p className='mt-4'>Настоящие Условия применяются к интернет-услугам (далее именуемым «Услуги»),
        предоставляемым WeaYaa LLC (далее именуемой «Компания»), компанией, которая
        управляет Top-Class, и могут использоваться независимо от типа проводного или
        беспроводного терминала, к которому можно получить доступ. Цель этого —
        оговорить права, обязанности и ответственность участников при использовании
        сайта (имея в виду все услуги, предоставляемые сайтом).</p>

      <p className='mt-8'>Статья 2 (Определения)</p>

      <p className='mt-4'>1. Термины, используемые в настоящих Условиях, имеют следующие значения:</p>

      <p className='mt-4'>а. «Сайт» означает виртуальный бизнес-сайт, созданный компанией для
        осуществления транзакций с продуктами и т. д. с использованием информационного
        и коммуникационного оборудования, такого как компьютеры, с целью
        предоставления продуктов и т. д., таких как лекции и курсы (далее именуемые
        «продукты»). и т. д. для участников. Также используется для обозначения бизнес-
        оператора, который управляет кибермоллом. В настоящее время компания
        управляет сайтом https://www.Top-Class.com, который также включает мобильный
        веб-сайт и приложения, в том числе сервисы для сред Android и iOS.</p>

      <p className='mt-4'>b.
        «Участник» означает лицо, которое зарегистрировалось в качестве участника,
        предоставив персональные данные на сайте, и которое постоянно получает
        информацию с сайта и может постоянно пользоваться услугами, предоставляемыми
        сайтом, в соответствии с политикой регистрации участников, установленной
        сайтом. . .</p>

      <p className='mt-4'>c.
        «Пароль» — это комбинация английских букв и цифр, установленная участником
        и зарегистрированная на сайте для проверки личности участника и защиты его прав
        и секретов.</p>

      <p className='mt-4'>2. Любые термины, не определенные в настоящих Условиях, регулируются
        соответствующими законами и правилами, а в отношении всех других терминов
        применяются общие обычаи.</p>

      <p className='mt-8'>Статья 3 (Изложение, разъяснение и пересмотр положений и условий)</p>

      <p className='mt-4'>1. Компания размещает содержание настоящих положений и условий, имя и
        фамилию представителя, адрес, номер телефона, адрес электронной почты,
        регистрационный номер предприятия и т. д. на начальном экране обслуживания
        сайта, чтобы участники могли легко их просмотреть. Однако участники могут
        просмотреть подробную информацию об условиях и положениях на экране
        подключения.</p>

      <p className='mt-4'>2. В соответствии со статьей 427 Гражданского кодекса Республики Узбекистан
        Компания обязуется предоставить Покупателю необходимую и достоверную
        информацию о продаваемом Контенте в соответствии с требованиями,
        установленными законодательством или обычно требуемыми для Контента,
        реализуемого в розничной торговле. торговля. Также Республика Узбекистан может
        вносить изменения в настоящие Условия в той мере, в которой они не нарушают
        соответствующие законы и нормативные акты, Положение о розничной торговле
        Республики Узбекистан, порядке осуществления электронной коммерции и порядке
        предоставления такой информации, утвержденное Постановлением Кабинета
        Министров Республики Узбекистан от 2 июня 2016 года № 185.</p>

      <p className='mt-4'>3. Когда компания пересматривает положения и условия, она публикует дату
        вступления в силу и причину пересмотра на главном экране сайта вместе с
        текущими положениями и условиями, которые действуют с 7 дней до даты
        вступления в силу и до дня, предшествующего дате вступления в силу. .</p>

      <p className='mt-4'>4. Если компания пересмотрит положения и условия, пересмотренные положения и
        условия будут применяться только к контрактам, заключенным после даты
        вступления в силу, а положения и условия до пересмотра будут продолжать
        применяться к контрактам, уже заключенным до этой даты. Однако, если член,
        который уже заключил договор, направляет компании уведомление в течение срока
        уведомления об измененных положениях и условиях в соответствии с пунктом 3,
        выражая свое намерение применить измененные положения и условия, и получает
        согласие компании, Будут применяться пересмотренные положения и условия.</p>

      <p className='mt-4'>5. Если участник продолжает пользоваться услугами компании после даты
        вступления в силу, объявленной в соответствии с пунктом 3, он/она будет считаться
        согласившимся с пересмотренными положениями и условиями. Участники, не
        согласные с пересмотренными условиями, могут свободно расторгнуть соглашение
        об обслуживании в любое время.</p>

      <p className='mt-8'>Статья 4 (Правила, отличные от положений и условий)</p>

      <p className='mt-4'>Вопросы, не урегулированные настоящими Условиями, а также толкование
        настоящих Условий регулируются статьей 427 Гражданского кодекса Республики
        Узбекистан и Общими правилами осуществления электронной коммерции и
        порядка предоставления такой информации, утвержденными Постановление
        Кабинета Министров Республики Узбекистан № 185.</p>

      <p className='mt-8'>Статья 5 (Заключение соглашения об использовании)</p>

      <p className='mt-4'>1. Пользовательское соглашение заключается, когда лицо, желающее стать
        участником (далее именуемое «заявитель»), заполняет информацию о членстве в
        соответствии с формой заявления о членстве, установленной компанией, проходит
        процедуру проверки номера мобильного телефона и подает заявку на членство,
        соглашаясь с условиями. Соглашение заключается, когда компания одобряет заявку.</p>

      <p className='mt-4'>2. Компания одобряет членство пользователей, подавших заявку на членство в
        соответствии с пунктом 1, если они не подпадают ни под один из следующих
        пунктов.</p>

      <p className='mt-4'>а. Если заявитель ранее утратил членство из-за настоящих положений и условий.
        Однако исключение может быть сделано для тех, кто утратил свое членство и
        получил одобрение компании на повторное вступление в членство через 3 месяца.</p>

      <p className='mt-4'>b. Если в регистрационной информации содержатся ложные сведения, упущения
        или ошибки</p>

      <p className='mt-4'>c. Если ваш номер мобильного телефона, имя или адрес электронной почты
        совпадают с номерами существующего участника</p>

      <p className='mt-4'>d. Если вы намерены использовать данную услугу в незаконных целях или в целях
        получения прибыли.</p>

      <p className='mt-4'>е. В случае подтверждения того, что заявка на использование нарушает настоящие</p>

      <p className='mt-4'>Условия или является незаконной или ненадлежащей</p>

      <p className='mt-4'>f. Когда другие компании на основе разумного суждения считают это необходимым</p>

      <p className='mt-4'>g. В случаях, когда считается, что одобрение других заявлений на членство
        представляет значительные технические трудности</p>

      <p className='mt-4'>3. В случае, если заявка на членство не одобрена или не зарезервирована в
        соответствии с пунктом 2, Компания, как правило, уведомляет об этом заявителя.</p>

      <p className='mt-4'>4. Временем заключения договора на оказание услуг является момент, когда
        компания указывает в заявке о завершении регистрации.</p>

      <p className='mt-4'>5. Компания может дифференцировать использование своих членов, разделяя их на
        разные уровни в соответствии с политикой компании, а также указывая время
        использования, количество использований, меню услуг и т. д.</p>

      <p className='mt-4'>6. Если в информации, зарегистрированной при регистрации членства, произошли
        изменения, член должен уведомить компанию об изменении в течение разумного
        периода времени путем изменения информации о члене.</p>

      <p className='mt-8'>Статья 6 (Защита личной информации)</p>

      <p className='mt-4'>1. Компания соблюдает законы Республики Узбекистан и другие соответствующие
        законы и нормативные акты для защиты личной информации участников.</p>

      <p className='mt-4'>2. В целях защиты личной информации участников компания устанавливает
        политику обработки личной информации и размещает ее на первом экране
        сервиса. Однако вы можете ознакомиться с подробностями политики обработки
        персональных данных, перейдя по ссылке.</p>

      <p className='mt-4'>3. Когда компания собирает и использует персональные данные участника, она
        уведомляет участника о цели и получает его согласие, а также прилагает все усилия
        для максимально возможной защиты персональных данных участника в
        соответствии с политикой обработки персональных данных.</p>

      <p className='mt-4'>4. Политика конфиденциальности компании не распространяется на связанные
        сайты, кроме официального сайта компании. Участники несут ответственность за
        проверку политик конфиденциальности третьих лиц, предоставляющих связанные
        сайты и продукты и т. д., в отношении их обработки личной информации, и
        компания не несет за это ответственности.</p>

      <p className='mt-4'>5. Компания вправе предоставлять персональные данные участников третьим лицам
        в объеме, разрешенном законом, в следующих случаях:</p>

      <p className='mt-4'>а. При запросе информации следственными органами или другими
        государственными органами</p>

      <p className='mt-4'>b. В случаях, когда это необходимо для работы по защите информации, например,
        для подтверждения неправомерного поведения, включая нарушение законов или
        положений и условий членства.</p>

      <p className='mt-4'>c. Когда это необходимо для выполнения заказа на момент покупки, а также когда
        это необходимо для возврата, обмена, возмещения, отмены и т. д. после
        завершения покупки.</p>

      <p className='mt-4'>d. В случае если будет требоваться по другими законами</p>

      <p className='mt-8'>Статья 7 (Выход из членства и утрата квалификации)</p>

      <p className='mt-4'>1. Члены могут в любое время подать заявку на выход из компании, и компания
        обработает такие заявки в соответствии с правилами выхода из членства.</p>

      <p className='mt-4'>2. Если член подпадает под одну из следующих причин, компания может
        ограничить или приостановить членство.</p>

      <p className='mt-4'>а. В случае угрозы порядку электронной торговли, например, создания помех
        использованию сайта другими лицами или кражи их информации</p>

      <p className='mt-4'>b. В случае, если сайт используется для совершения действий, запрещенных
        законами и настоящими Условиями или противоречащих общественному порядку и
        морали, или в случае, если компания на основании разумного суждения определит,
        что это необходимо</p>

      <p className='mt-4'>c. В случае нанесения ущерба репутации компании или подрыва надежности сайта
        путем изложения или распространения необоснованных или ложных фактов,
        связанных с работой сайта</p>

      <p className='mt-4'>d. Если вы мешаете работе сайта, используя оскорбительные выражения, угрозы
        или непристойные выражения в адрес персонала во время использования сайта</p>

      <p className='mt-4'>е. Если вы мешаете деятельности компании, систематически отменяя или
        возвращая весь или часть товара, приобретенного через сайт, без уважительной
        причины, даже если в товаре не обнаружено никаких особых дефектов после
        частичного использования.</p>

      <p className='mt-4'>3. Если одно и то же действие повторяется более двух раз после того, как компания
        ограничила или приостановила членство, или если причина не устранена в течение
        30 дней, компания имеет право отозвать членство.</p>

      <p className='mt-4'>4. Если участник нарушает порядок транзакций на сайте, например, покупая
        несколько товаров на сайте с целью перепродажи, компания может отозвать
        членство такого участника.</p>

      <p className='mt-4'>5. Если компания теряет свое членство, ее регистрация членства аннулируется. В
        этом случае член будет уведомлен и ему будет предоставлено не менее 30 дней для
        объяснения причин, прежде чем членство будет аннулировано.</p>

      <p className='mt-8'>Статья 8 (Обязанности участника относительно идентификатора и пароля)</p>

      <p className='mt-4'>1. Участники несут ответственность за управление своим идентификатором (адресом
        электронной почты) и паролем, и вся гражданская и уголовная ответственность,
        возникающая в результате халатности при этом, является ответственностью
        участника.</p>

      <p className='mt-4'>2. Участники не должны позволять третьим лицам использовать их идентификатор и
        пароль.</p>

      <p className='mt-4'>3. Вы не имеете права использовать сервис на двух или более устройствах
        одновременно с одним и тем же идентификатором участника, запускать программу
        копирования во время использования сервиса или использовать сервис
        несанкционированным образом, например, путем записи.</p>

      <p className='mt-4'>4. Если участнику становится известно, что его/ее идентификатор и пароль были
        украдены или используются третьим лицом, он/она должен/должна немедленно
        уведомить об этом компанию и следовать всем мерам, принятым компанией.</p>

      <p className='mt-4'>5. Участник несет ответственность за все убытки, возникшие в результате
        непредставления участником уведомления в соответствии со статьей 4 или
        непринятия мер компанией.</p>

      <p className='mt-8'>Статья 9 (Обязанности участников)</p>

      <p className='mt-4'>1. Участники должны соблюдать соответствующие законы, положения настоящих
        Условий, руководство пользователя и другие положения, о которых уведомляет
        Компания, и не должны совершать никаких других действий, которые мешают
        деятельности Компании.</p>

      <p className='mt-4'>2. Участники не должны совершать следующие действия в связи с использованием
        сервиса.</p>

      <p className='mt-4'>а. Регистрация ложных сведений при подаче заявки на получение или изменение
        услуг</p>

      <p className='mt-4'>b. Кража чужой информации</p>

      <p className='mt-4'>c. Несанкционированное изменение информации, размещенной на сайте</p>

      <p className='mt-4'>d. Передача или размещение информации (компьютерных программ и т.п.),
        отличной от информации, указанной компанией</p>

      <p className='mt-4'>е. Нарушение прав интеллектуальной собственности, включая авторские права,
        компании и других третьих лиц</p>

      <p className='mt-4'>f. Любое действие, наносящее ущерб репутации компании или других третьих лиц
        или мешающее их бизнесу.</p>

      <p className='mt-4'>g. Действия по раскрытию или размещению непристойных или агрессивных
        сообщений, изображений, голосов или другой информации, противоречащей
        общественному порядку и морали компании</p>

      <p className='mt-4'>h. Использование сервиса в корыстных целях без согласия компании</p>

      <p className='mt-4'>i. Любое действие, нарушающее другие соответствующие законы или правила
        компании.</p>

      <p className='mt-8'>Статья 10 (Должности членов)</p>

      <p className='mt-4'>1. Все права и обязанности за сообщения, написанные участниками, принадлежат
        участнику, который их разместил, и компания может удалить содержимое сервиса,
        размещенное или зарегистрированное участником, без предварительного
        уведомления, если определит, что содержимое подпадает под любое из следующих
        положений: Товары. Компания не несет никакой ответственности.</p>

      <p className='mt-4'>a. Если контент порочит или клевещет на других участников или третьих лиц и
        наносит ущерб их репутации</p>

      <p className='mt-4'>b. Если содержание нарушает общественный порядок и мораль</p>

      <p className='mt-4'>c. Если будет установлено, что это связано с преступной деятельностью</p>

      <p className='mt-4'>d. Если контент нарушает авторские права компании, авторские права третьих лиц
        или другие права</p>

      <p className='mt-4'>e. Если участник размещает непристойные материалы на сайте или доске
        объявлений или ссылки на непристойный сайт</p>

      <p className='mt-4'>f. Если вы публикуете коммерческую рекламу или рекламный контент без
        предварительного одобрения компании</p>

      <p className='mt-4'>g. Если контент не связан с продуктом</p>

      <p className='mt-4'>h. Если вы пишете контент, который мешает нашему бизнесу без законных на то
        оснований</p>

      <p className='mt-4'>i. В случае, если будет установлено, что это нарушает другие соответствующие
        законы и правила</p>

      <p className='mt-8'>Статья 11 (Уведомление для участников)</p>

      <p className='mt-4'>1. Когда компания уведомляет участников, она может делать это по адресу
        электронной почты, текстовому сообщению, KakaoTalk, push-уведомлению и т. д.,
        указанным при регистрации, в зависимости от настроек уведомлений участника.
        Однако существенная информация, связанная с использованием услуг, информация,
        связанная с транзакциями в соответствии с действующим законодательством, а
        также ответы на запросы клиентов будут отправляться независимо от настроек
        уведомлений.</p>

      <p className='mt-4'>2. В случае уведомления неопределенного числа членов компания может заменить
        индивидуальное уведомление размещением на веб-сайте сроком не менее одной
        недели. Тем не менее, членам будет направлено индивидуальное уведомление по
        вопросам, которые могут оказать существенное влияние на их операции.</p>

      <p className='mt-8'>Статья 12 (Обязанности компании)</p>

      <p className='mt-4'>1. Компания не должна совершать никаких действий, запрещенных
        соответствующими законами и правилами или настоящими Условиями или
        противоречащих общественному порядку и морали, и должна делать все
        возможное для непрерывного и стабильного предоставления продукции и т. д. в
        соответствии с настоящими Условиями. .</p>

      <p className='mt-4'>2. Компания должна иметь систему безопасности для защиты личной информации
        участников (включая кредитную информацию), чтобы участники могли безопасно
        пользоваться услугой, а также должна раскрывать и соблюдать политику обработки
        личной информации.</p>

      <p className='mt-4'>3. Если компания объективно определит, что мнение или жалоба, высказанная
        членом, обоснованы, она должна немедленно обработать их с помощью
        соответствующих процедур. Однако если немедленная обработка затруднена,
        участник должен быть уведомлен о причине и графике обработки.</p>

      <p className='mt-4'>4. Компания не рассылает пользователям нежелательные коммерческие
        электронные письма или текстовые сообщения с целью получения прибыли.</p>

      <p className='mt-8'>Статья 13 (Предоставление и изменение услуг)</p>

      <p className='mt-4'>1. Компания предоставляет следующие услуги:</p>

      <p className='mt-4'>а. Услуги электронной коммерции и сопутствующие услуги для услуг, указанных на
        сайте, управляемом компанией</p>

      <p className='mt-4'>б. Другие услуги или работы, определяемые компанией</p>

      <p className='mt-4'>2. Компания может изменить состав продукции, поставляемой по контракту,
        который будет заключен в будущем, по таким причинам, как отсутствие продукции
        на складе или изменение технических характеристик. В этом случае сведения об
        измененном товаре и т.п., а также дата предоставления указываются и немедленно
        сообщаются в месте, где размещены сведения о текущем товаре и т.п.</p>

      <p className='mt-4'>3. Если Компания изменит содержание услуги, на которую она заключила договор с
        участником, по таким причинам, как отсутствие товара на складе или изменение
        технических характеристик, она немедленно уведомит об этом участника.</p>

      <p className='mt-4'>4. В случае, указанном в предыдущем пункте, компания возместит фактический
        ущерб, понесенный участником в связи с доказанной причинно-следственной
        связью. Однако это не применяется, если компания докажет, что не было умысла
        или халатности.</p>

      <p className='mt-8'>Статья 14 (Условия использования отдельных услуг)</p>

      <p className='mt-4'>Компания может устанавливать отдельные положения и условия использования для
        каждой услуги в рамках предоставляемых ею услуг, и участники будут проходить
        отдельную процедуру согласия при первом использовании каждой услуги, чтобы
        согласиться с положениями и условиями, которые применяются отдельно к каждой
        услуге. В этом случае условия использования каждой отдельной услуги имеют
        приоритет над настоящими условиями.</p>

      <p className='mt-8'>Статья 15 (Время использования услуги)</p>

      <p className='mt-4'>В принципе, услуга доступна 24 часа в сутки, 365 дней в году, если только не
        возникнут особые деловые или технические проблемы. Однако дни или время,
        установленные компанией для регулярных проверок и т. д., не учитываются.
        Регулярное время технического обслуживания указано на экране предоставления
        услуг.</p>

      <p className='mt-8'>Статья 16 (Ответственность за использование услуг)</p>

      <p className='mt-4'>Участники не могут использовать Сервис для осуществления коммерческой
        деятельности, такой как продажа продукции, за исключением случаев, специально
        разрешенных Компанией в письменной форме, и, в частности, не могут
        осуществлять коммерческую деятельность, такую как хакерство, реклама с целью
        получения прибыли, порнографические веб-сайты. , или коммерческое ПО
        Незаконное распространение и т.п. запрещено. Компания не несет ответственности
        за результаты и убытки хозяйственной деятельности, нарушающей это положение, а
        также за правовые действия, предпринятые соответствующими организациями.</p>

      <p className='mt-8'>Статья 17 (Приостановка предоставления услуг)</p>

      <p className='mt-4'>1. Компания вправе приостановить оказание услуг в следующих случаях:</p>

      <p className='mt-4'>а. В случае технического обслуживания, проверки, замены или поломки
        информационно-коммуникационного оборудования, такого как компьютеры, или
        прерывания связи и т. д.</p>

      <p className='mt-4'>b. В случае приостановления операторами телекоммуникационных услуг на
        территории Республики Узбекистан оказания услуг телекоммуникаций;</p>

      <p className='mt-4'>c. В случае возникновения других форс-мажорных обстоятельств</p>

      <p className='mt-4'>2. Если нормальное использование услуг затруднено из-за чрезвычайной ситуации в
        стране, отключения электроэнергии, отказа оборудования или резкого увеличения
        потребления услуг, Компания может ограничить или приостановить предоставление
        услуг полностью или частично. В случае если компания временно приостанавливает
        или прекращает предоставление услуг, факт временного приостановления
        предоставления услуг и его причина будут указаны на главном экране сайта.</p>

      <p className='mt-8'>Статья 18 (Предоставление информации и размещение рекламы)</p>

      <p className='mt-4'>1. Компания может предоставлять членам различную информацию, которая им
        необходима во время использования сервиса, посредством уведомлений,
        электронной почты, текстовых сообщений, Telegram, push-уведомлений, телефона и
        т. д. Однако участники могут отказаться от получения электронных писем и т. п. в
        любое время, за исключением информации, связанной с транзакциями, и ответов
        на запросы клиентов в соответствии с действующим законодательством.</p>

      <p className='mt-4'>2. Компания может размещать рекламу на экранах сервиса, домашних страницах, в
        электронных письмах и т. д., связанную с работой сервиса. Участники, получившие
        электронные письма, содержащие рекламу и т.п., могут попросить компанию
        прекратить отправку таких электронных писем.</p>

      <p className='mt-8'>Статья 19 (Заявление на покупку)</p>

      <p className='mt-4'>1. Участники должны подать заявку на покупку в соответствии с настоящими
        Условиями и положениями, а также правилами, установленными Компанией,
        используя указанные ниже методы или аналогичные методы.</p>

      <p className='mt-4'>а. Выбор продукции и т.д.</p>

      <p className='mt-4'>b. Введите имя покупателя, адрес, номер телефона, адрес электронной почты, имя
        получателя, информацию о доставке и номер телефона.</p>

      <p className='mt-4'>c. Проверьте примечания к платежу.</p>

      <p className='mt-4'>d. Укажите, что вы согласны с этими условиями (например, щелкнув мышью)</p>

      <p className='mt-4'>2. Когда участник запрашивает покупку, компания отправляет участнику
        подтверждение получения.</p>

      <p className='mt-4'>3. Участники, получившие уведомление о подтверждении получения, указанное в
        предыдущем абзаце, могут потребовать изменения или отмены заявки на покупку
        немедленно после получения уведомления о подтверждении получения, если в
        выражении намерений есть расхождения. Однако если оплата уже произведена,
        применяются положения статьи 25 об отзыве подписки и т. д.</p>

      <p className='mt-8'>Статья 20 (Способ оплаты)</p>

      <p className='mt-4'>1. Оплата продукции или купонов, приобретенных у компании, может быть
        произведена одним из следующих способов.</p>

      <p className='mt-4'>а. Оплата картой</p>

      <p className='mt-4'>b. Оплата Payme</p>

      <p className='mt-4'>c. Другие способы оплаты, указанные компанией (купоны на скидку, приложения
        для смартфонов и т. д.)</p>

      <p className='mt-4'>2. Участник несет полную ответственность за любую информацию, введенную им в
        связи с уплатой покупной цены, а также за любую ответственность или ущерб,
        возникающие в связи с такой информацией.</p>

      <p className='mt-8'>Статья 21 (Купон на скидку)</p>

      <p className='mt-4'>1. Купоны на скидку — это купоны, выпускаемые компанией, которые можно
        классифицировать по цели выпуска, пути выпуска и цели использования. Для
        получения подробной информации о подробной классификации купонов на скидку,
        размере скидки (ставке скидки), способе использования, периоде использования и
        ограничения см. на экране «Отображается на купоне на скидку или в услуге». Тип,
        содержание и выдача купонов на скидку могут различаться в зависимости от
        политики компании.</p>

      <p className='mt-4'>2. Купоны на скидку не подлежат обналичиванию наличными и аннулируются по
        истечении срока действия, указанного на купоне на скидку, или по расторжении
        договора пользования.</p>

      <p className='mt-4'>3. Купоны на скидку не могут быть переданы другим лицам, за исключением
        случаев, когда компания прямо указывает иное, и не могут быть использованы в
        ненадлежащих целях или целях. В случае нарушения этого правила компания имеет
        право аннулировать купоны на скидку или приостановить членство.</p>

      <p className='mt-4'>4. Если будет подтверждено, что участник получил купон на скидку мошенническим
        путем, компания может принять меры, такие как изъятие купона на скидку у
        участника, аннулирование членства участника и подача уголовного заявления.</p>

      <p className='mt-8'>Статья 22 (Поставка товаров и т.п.)</p>

      <p className='mt-4'>1. Если не заключено отдельного соглашения относительно поставки продукции и т.
        д. членам, компания должна заниматься индивидуальным изготовлением, заказом,
        закупкой, проверкой, упаковкой и т. д. таким образом, чтобы продукция и т. д.
        могла быть доставлена как можно скорее. с даты покупки участником. Принять
        необходимые меры.</p>

      <p className='mt-4'>2. Компания должна принять соответствующие меры, чтобы позволить членам
        проверять процесс поставки и ход выполнения продуктов и т. д., а также реквизиты
        для оплаты покупок продуктов и т. д., а также должна предоставить руководство по
        способу и процедуре отмены продуктов и т. д.</p>

      <p className='mt-4'>3. Компания указывает способ доставки, стоимость доставки по способу, лицо,
        ответственное за стоимость доставки, и срок доставки по способу для продуктов,
        приобретенных участниками.</p>

      <p className='mt-4'>4. Если между компанией и клиентом имеется отдельное соглашение относительно
        поставки и доставки продукции, а также сроков предоставления купонов, оно имеет
        приоритет над настоящими условиями.</p>

      <p className='mt-8'>Статья 23 (Возврат)</p>

      <p className='mt-4'>Если компания не может доставить или предоставить продукт, запрошенный для
        покупки участником, по таким причинам, как отсутствие на складе, она должна
        незамедлительно уведомить участника о причине, а если оплата за продукт была
        получена заранее, она должна необходимо уведомить участника в течение 7
        рабочих дней с даты получения платежа. Мы вернем вам деньги или предпримем
        необходимые шаги для получения возврата в течение этого времени.</p>

      <p className='mt-8'>Статья 24 (Политика возврата средств компании)</p>

      <p className='mt-4'>1. Политика компании по возврату средств и т. д., изложенная в настоящих
        Условиях, должна соответствовать соответствующим законам и нормативным актам,
        включая Закон о защите прав потребителей в электронной коммерции и т. д., а
        также указ о его применении.</p>

      <p className='mt-4'>2. Участники должны уведомить компанию в письменной форме о любых запросах
        на возврат или изменение. Компания получит запрос на возврат, подтвердит запрос
        участника и политику возврата компании и предоставит возврат как можно скорее.</p>

      <p className='mt-4'>3. Участники могут потребовать от компании возврата средств или изменения
        платных услуг по контенту в соответствии со следующими пунктами. Однако такие
        действия, как потоковая передача или загрузка видеофайлов лекций или файлов
        лекционных материалов (далее именуемых «файлами») на электронные устройства,
        такие как ПК, смартфоны, смарт-планшеты и PMP (далее именуемые
        «использование»), считаются как при использовании 1 лекции на файл.</p>

      <p className='mt-4'>4. Политика компании по возврату средств за продукцию и т.п. следующая.</p>

      <p className='mt-4'>а. Если вы запросите возврат средств до того, как файл будет опубликован (до того,
        как будет опубликована видеозапись лекции) после оплаты, вы можете получить
        полный возврат средств.</p>

      <p className='mt-4'>b. Если вы запросите возврат средств в течение 7 дней с даты оплаты и
        использовали менее 3 файлов, вы можете получить полный возврат средств.</p>

      <p className='mt-4'>c. Если вы запросите возврат средств в течение 7 дней с даты оплаты и
        использовали 3 или более файлов, мы вернем вам половину фактической суммы
        платежа.</p>

      <p className='mt-4'>d. Если вы используете менее 3 файлов и более 7 дней, но менее 10 дней с даты
        оплаты, мы вернем вам половину фактической суммы оплаты.</p>

      <p className='mt-4'>е. Если вы используете более 7 дней, но менее 10 дней с даты оплаты и
        используете 3 или более файлов, возврату не подлежит.</p>

      <p className='mt-4'>f. По истечении 10 дней с даты оплаты возврат денежных средств не производится.</p>

      <p className='mt-4'>g. Если дополнительное использование видеофайлов лекций или файлов
        лекционных материалов подтверждается до фактического возврата средств после
        подтверждения суммы возврата, возвращаемая сумма может отличаться.</p>

      <p className='mt-4 font-semibold'>Дата платежа</p>

      <p className='mt-4 font-semibold'>Количество использованных файлов</p>

      <p className='mt-4 font-semibold'>Ставка возврата</p>

      <p className='mt-4'>Перед выпуском файла после оплаты</p>

      <p className='mt-4'>не существует</p>

      <p className='mt-4'>100%</p>

      <p className='mt-4'>В течение 7 дней с даты оплаты</p>

      <p className='mt-4'>Меньше 3</p>

      <p className='mt-4'>100%</p>


      <p className='mt-4'>В течение 7 дней с даты оплаты</p>

      <p className='mt-4'>3 или больше</p>

      <p className='mt-4'>50%</p>

      <p className='mt-4'>Более 7 дней, но в течение 10 дней с даты оплаты</p>

      <p className='mt-4'>Меньше 3</p>

      <p className='mt-4'>50%</p>

      <p className='mt-4'>Более 7 дней, но в течение 10 дней с даты оплаты</p>

      <p className='mt-4'>3 или больше</p>

      <p className='mt-4'>0%</p>

      <p className='mt-4'>Более 10 дней с даты оплаты</p>

      <p className='mt-4'>военный офицер</p>

      <p className='mt-4'>0%</p>

      <p className='mt-4'>5. Специальные курсы включают в себя курсы мероприятий, нерегулярные курсы и
        специальные курсы планирования, и к этим курсам могут применяться отдельные
        правила отмены, изменения и возврата средств.</p>

      <p className='mt-4'>6. Как правило, возврат средств осуществляется теми же способома, которые использовал пользователь например, оплата кредитной картой, Payme. Однако в случаях, когда возврат средств невозможен, например, частичный возврат, возврат будет осуществлен другим согласованным способом.</p>

      <p className='mt-4'>7. Сумма возврата рассчитывается на основе фактической суммы платежа, а не
        обычной цены.</p>

      <p className='mt-4'>8. Исключения из возврата средств Компанией следующие:</p>

      <p className='mt-4'>а. Если член компании принудительно исключен из нее из-за нарушения
        соответствующих законов и нормативных актов, а также положений настоящих
        Условий, политика возврата средств, предусмотренная настоящей статьей, не
        применяется.</p>

      <p className='mt-4'>b. Любая сумма, полученная участником по купонам на скидку и т.п.,
        предоставленным компанией участнику бесплатно, не возвращается.</p>

      <p className='mt-4'>9. Несмотря на пункт 4 настоящей статьи, Компания может временно смягчить
        условия возврата средств в целях повышения надежности или в случае наступления
        событий.</p>

      <p className='mt-8'>Статья 25 (Отзыв подписки и т.д.)</p>

      <p className='mt-4'>1. Политика компании в отношении отмены покупки продукции и возврата денег
        соответствует соответствующим законам и нормативным актам, включая Закон о
        защите прав потребителей в электронной коммерции и т. д., а также постановление
        о его применении.</p>

      <p className='mt-4'>2. Члены, заключившие с обществом договор на закупку продукции и т.п., имеют
        право на оплату в течение 7 дней с даты получения уведомления-подтверждения
        (если поставка продукции и т.п. осуществляется позднее даты получения
        уведомления, даты начала поставки продукции и т. д.) Вы можете отозвать подписку
        в течение 1 дня.</p>

      <p className='mt-4'>3. Если у Компании возникли трудности с поставкой продукции из-за обстоятельств,
        связанных с отечественными или зарубежными производителями, поставщиками
        или инструкторами, Компания должна уведомить члена о причине и предоставить
        возврат средств или принять необходимые меры для возврата средств в течение 7
        рабочих дней с момента возникновения дата возникновения причины.</p>

      <p className='mt-4'>4. Если участник получает или получает продукт и т.п., он/она не может отменить
        подписку и т.п. в любом из следующих случаев:</p>

      <p className='mt-4'>а. Если товар утерян или поврежден по вине участника. Однако это не относится к
        случаям, когда упаковка была повреждена в целях проверки содержимого продукта.</p>

      <p className='mt-4'>b. Если стоимость продукта и т.п. значительно снизилась или его стоимость
        полностью израсходована в результате использования или частичного потребления
        членом</p>

      <p className='mt-4'>c. Когда стоимость продукта со временем значительно снизилась до такой степени,
        что его трудно перепродать</p>

      <p className='mt-4'>d. Если упаковка товара, который можно скопировать, повреждена</p>

      <p className='mt-4'>е. Если компания заранее уведомила об ограничениях по отмене подписки на
        продукты и т.п. (включая статью 24 настоящих Условий)</p>

      <p className='mt-4'>f. В иных случаях, предусмотренных законом для обеспечения безопасности сделок.</p>

      <p className='mt-4'>5. В случае аннулирования подписки и т.п. член несет расходы, необходимые для
        возврата поставленных товаров. Компания не требует от членов возмещения
        убытков или компенсации по таким причинам, как отмена подписки. Однако, если
        содержимое продукта и т. п. отличается от отображаемого/рекламируемого
        содержимого или выполняется не так, как предусмотрено договором, компания
        будет нести расходы, необходимые для возврата продукта и т. п. при отмене
        подписки.</p>

      <p className='mt-4'>6. В случае отмены по причине простого изменения решения участника, участник
        несет расходы и другие расходы, понесенные при обработке возврата средств.</p>

      <p className='mt-8'>Статья 26 (Последствия отзыва подписки и т.д.)</p>

      <p className='mt-4'>1. Когда участник отменяет или возвращает купленный продукт и т.п., компания
        уведомит участника о результатах обработки в порядке, указанном в статье 11
        (Уведомление участников).</p>

      <p className='mt-4'>2. Если компания получит от участника запрос на отмену платежа или возврат
        товара, компания вернет уже уплаченную сумму в течение 7 рабочих дней. В этом
        случае, если компания задерживает возврат товара и т.п. участнику, компания
        выплачивает проценты за просрочку, рассчитанные путем умножения процентной
        ставки за просрочку, определенной и объявленной Комиссией по справедливой
        торговле, на период просрочки.</p>

      <p className='mt-4'>3. В случае аннулирования подписки и т.п. член несет расходы, необходимые для
        возврата поставленных товаров. Однако, если содержимое продукта и т. д.
        отличается от отображаемого/рекламируемого содержимого или выполняется не в
        соответствии с условиями договора, а подписка отменяется и т. д., компания будет
        нести расходы, необходимые для продукта и т. д.</p>

      <p className='mt-4'>4. В случае отмены по причине простого изменения решения со стороны участника,
        участник несет расходы и другие расходы, понесенные при обработке возврата
        средств.</p>

      <p className='mt-4'>5. Любые вопросы, касающиеся отмены и возврата средств, не указанные в
        настоящих Условиях и положениях, а также в Руководстве пользователя Сайта,
        регулируются Законом о защите прав потребителей в электронной коммерции и т.
        д., а также Стандартами разрешения потребительских споров.</p>

      <p className='mt-8'>Статья 27 (Особые положения об аннулировании и возврате товара и т.д.)</p>

      <p className='mt-4'>Возврат средств за возвращенный товар будет произведен после того, как
        возвращенный товар поступит к продавцу и будет подтверждена причина возврата,
        а также указано, кто будет нести ответственность за расходы по обратной доставке.</p>

      <p className='mt-8'>Статья 28 (Присвоение авторских прав и ограничения на использование)</p>

      <p className='mt-4'>1. Авторские права и другие права интеллектуальной собственности на
        произведения, видеолекции и лекционные материалы, созданные компанией,
        принадлежат компании.</p>

      <p className='mt-4'>2. Компания предоставляет членам только право использовать учетные записи,
        контент и т. д. в соответствии с условиями использования, установленными
        компанией в отношении сервиса, и члены не могут использовать информацию,
        полученную посредством использования сервиса, который компания имеет права
        интеллектуальной собственности на. Вы не можете использовать это в
        коммерческих целях или разрешать третьим лицам использовать это в
        коммерческих целях, например, путем копирования, передачи, публикации,
        распространения, трансляции или любыми другими способами, без
        предварительного согласия.</p>

        <p className='mt-4'>3. Пользователи, нарушающие авторские права и другие права интеллектуальной собственности, могут быть наказаны в соответствии с законами и нормативными актами, включая Закон Республики Узбекистан «Об информации и коммуникационных технологиях» и «Об авторском праве».</p>

      <p className='mt-8'>Статья 29 (Управление должностями)</p>

      <p className='mt-4'>1. Если публикация участника содержит контент, нарушающий соответствующие
        законы, такие как «Закон Республики Узбекистан «Об информации и
        коммуникациях» и «Об авторском праве», правообладатель может потребовать
        приостановки или удаления публикации в соответствии с установленными
        процедурами. в соответствующих законах. и компания должна принять меры в
        соответствии с соответствующими законами и правилами.</p>

      <p className='mt-4'>2. Даже если нет запроса от правообладателя в соответствии с предыдущим
        пунктом, компания может принять временные меры и т. д. в отношении
        соответствующей публикации в соответствии с действующим законодательством,
        если есть основания полагать, что права были нарушены. или если имеет место
        нарушение других политик компании или соответствующих законов.</p>

      <p className='mt-4'>3. Подробные процедуры в соответствии с настоящей статьей должны
        соответствовать «Службе подачи запроса на приостановление публикации»,
        созданной компанией в объеме, предусмотренном «Законом Республики Узбекистан
        «Об информации и коммуникациях» и «Законом об авторском праве».</p>

      <p className='mt-8'>Статья 30 (Отказ от ответственности компании)</p>

      <p className='mt-4'>1. Компания освобождается от ответственности за оказание услуг, если она не
        может оказать услуги вследствие стихийных бедствий или иных форс-мажорных
        обстоятельств.</p>

      <p className='mt-4'>1. Компания освобождается от ответственности за оказание услуг, если она не
        может оказать услуги вследствие стихийных бедствий или иных форс-мажорных
        обстоятельств.</p>

      <p className='mt-4'>2. Компания не несет ответственности за любые перебои в предоставлении услуг,
        вызванные виной участника.</p>

      <p className='mt-4'>3. Компания не несет ответственности за потерю ожидаемой прибыли, понесенную
        участниками в результате использования сервиса, а также за любой ущерб,
        причиненный информацией, полученной через другие сервисы.</p>

      <p className='mt-4'>4. Компания не несет ответственности за надежность, точность и т.п. информации,
        материалов и фактов, размещаемых участниками.</p>

      <p className='mt-4'>5. Пользователь несет юридическую ответственность за содержание электронных
        писем, отправляемых участником.</p>

      <p className='mt-4'>6. Компания освобождается от ответственности в случаях, когда сделки и т.п.
        совершаются между участниками или между участниками и третьими лицами
        посредством сервиса.</p>

      <p className='mt-4'>7. Компания не несет ответственности за использование услуг, предоставляемых
        бесплатно, если иное не предусмотрено соответствующими законами.</p>

      <p className='mt-8'>Статья 31 (Разрешение споров)</p>

      <p className='mt-4'>1. Компания создает и управляет организацией по обработке заявлений о
        возмещении ущерба, которая учитывает законные мнения или жалобы,
        высказанные членами, и компенсирует ущерб.</p>

      <p className='mt-4'>2. Компания уделяет первостепенное внимание рассмотрению жалоб и мнений,
        поданных членами. Однако в случаях, когда оперативная обработка затруднена,
        участник будет немедленно уведомлен о причине и графике обработки.</p>

      <p className='mt-8 '>Дополнительные положения</p>

      <p className='mt-4'>Настоящие Условия вступают в силу с 1 февраля 2025 года.</p>

      <p className='mt-4'>Настоящие пересмотренные положения и условия будут применяться только к
        контрактам, заключенным после даты вступления в силу, а положения и условия,
        действовавшие до пересмотра, останутся применимыми к контрактам, заключенным
        до даты вступления в силу.</p>

        <button className="bg-black text-white mt-8 rounded-lg px-3 py-2"
        onClick={() => navigate('/registration')} >
        Я прочитал/а, возвращаться к регистрацию 
      </button>

    </div>
  )
}

export default Сonditions